---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForMergePartFailures.UnableToIncludePartInMerge
source: html/f0db4066-b311-5c6b-76dd-c99633a926bf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForMergePartFailures.UnableToIncludePartInMerge Property

Attempt to merge this Part results in failure of boolean operation. Cannot compute combined geometry.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnableToIncludePartInMerge { get; }
```